## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for dev environment...
##
#########################################################

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

#########################################################
##
##   Planning changes for stg environment...
##
#########################################################

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

#########################################################
##
##   Planning changes for prod environment...
##
#########################################################

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

#########################################################
##
##   Planning changes for sandbox environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.registry[0].module.ingress[0].kubernetes_ingress_v1.this[0] will be updated in-place
  # (moved from module.registry[0].kubernetes_ingress_v1.registry_ingress[0])
  ~ resource "kubernetes_ingress_v1" "this" {
        id     = "registry/ingress-registry"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              + "cert-manager.io/cluster-issuer"                 = "letsencrypt-prod"
                # (6 unchanged elements hidden)
            }
            name             = "ingress-registry"
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.registry[0].kubernetes_namespace.registry[0] has moved to module.registry[0].module.namespace.kubernetes_namespace.this[0]
    resource "kubernetes_namespace" "this" {
        id                               = "registry"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.registry[0].module.persistence.kubernetes_persistent_volume_claim.this[0] must be replaced
  # (moved from module.registry[0].kubernetes_persistent_volume_claim.registry_storage)
-/+ resource "kubernetes_persistent_volume_claim" "this" {
      ~ id               = "registry/registry-storage" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "registry-storage"
          ~ resource_version = "12911910" -> (known after apply)
          ~ uid              = "6e296ff0-53e2-45fe-93f6-6d8b8b7db2e3" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ spec {
          ~ volume_mode        = "Filesystem" -> (known after apply)
          ~ volume_name        = "pvc-6e296ff0-53e2-45fe-93f6-6d8b8b7db2e3" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ resources {
              - limits   = {} -> null
                # (1 unchanged attribute hidden)
            }

          + selector { # forces replacement
            }
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

#########################################################
##
##   Planning changes for tools environment...
##
#########################################################

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

  ```
  
  Plan exit code: 0
  